app/Controllers/Pendataan.php

    public function index(): string
    {
        $educationLevelModel = new EducationLevelModel();
        $jobStatusModel      = new JobStatusModel();
        $skillModel          = new SkillModel();
        $interestModel       = new InterestModel();

        // Safely fetch reference data if tables exist
        $wilayahWithCabang = [];
        $educationLevels   = [];
        $jobStatuses       = [];
        $skills            = [];
        $interests         = [];

        try {
            $wilayahWithCabang = $this->wilayahModel->getWithCabang();
            $cabangList        = $this->cabangModel->orderBy('name', 'ASC')->findAll();
            $educationLevels   = $educationLevelModel->findAll();
            $jobStatuses       = $jobStatusModel->findAll();
            $skills            = $skillModel->findAll();
            $interests         = $interestModel->findAll();
---
SELECT *
FROM `education_levels`
SELECT *
FROM `job_statuses`
SELECT *
FROM `skills`
SELECT *
FROM `interests`