app/Models/WilayahModel.php

    public function getWithCabang(?int $wilayahId = null, ?int $cabangId = null): array
    {
        $builder = $this->orderBy('id', 'ASC');
        if (!empty($wilayahId)) {
            $builder->where('id', $wilayahId);
        }
        $wilayahList = $builder->findAll();
        $cabangModel = new CabangModel();

        foreach ($wilayahList as &$w) {
            $cBuilder = $cabangModel->where('wilayah_id', $w['id'])->orderBy('name', 'ASC');
            if (!empty($cabangId)) {
                $cBuilder->where('id', $cabangId);
            }
            $w['cabang'] = $cBuilder->findAll();
---
SELECT *
FROM `wilayah`
ORDER BY `id` ASC
SELECT *
FROM `cabang`
WHERE `wilayah_id` = '1'
ORDER BY `name` ASC